{
	"Elementary": {
		"It's so hot that even lead would melt here": "venus",
		"The largest animal on land": "elephant",
		"This is the shape of the Earth": "sphere",
		"The tallest mountain on Earth": "everest",
		"A fruit that is yellow and sour": "lemon",
		"This gas is essential for humans to breathe": "oxygen",
		"The country shaped like a boot": "italy",
		"This insect is known for making honey": "bee",
		"The largest ocean in the world": "pacific",
		"The color of grass": "green"
	},
	"Highschool": {
		"Question 4": "answer",
		"Question 5": "answer",
		"Question 6": "answer"
	},
	"College": {
		"This principle states that the total energy in a closed system remains constant.": "Conservation of Energy",
		"This law of motion explains how an object moves when no forces act on it.": "Newtons First Law",
		"This phenomenon describes how light bends when it passes through different media.": "Refraction",
		"This fundamental force is responsible for holding the nucleus of an atom together.": "Strong Nuclear Force",
		"This type of wave does not require a medium to travel through.": "Electromagnetic Wave",
		"This famous scientist developed the theory of relativity.": "Albert Einstein",
		"This particle has a negative charge and orbits the nucleus of an atom.": "Electron",
		"This is the unit of electric current.": "Ampere",
		"This device is used to measure the electric potential difference between two points.": "Voltmeter",
		"This force is responsible for the motion of the planets around the Sun.": "Gravitational Force",
		"This theory explains the behavior of gases in terms of particles in motion.": "Kinetic Molecular Theory",
		"This type of radiation has the highest energy and can ionize atoms.": "Gamma Rays",
		"This law relates the pressure and volume of a gas at constant temperature.": "Boyles Law",
		"This philosopher is famous for his work Meditations.": "Marcus Aurelius",
		"This theory suggests that actions should aim for the greatest happiness for the greatest number.": "Utilitarianism",
		"This philosopher wrote The Republic and proposed the theory of Forms.": "Plato",
		"This philosopher is known for the Socratic method and his contributions to ethics.": "Socrates",
		"This concept refers to the fundamental nature of reality and existence.": "Metaphysics",
		"This philosopher wrote the book On Liberty and is known for his contributions to political philosophy.": "John Stuart Mill",
		"This philosophical branch studies the nature of knowledge.": "Epistemology",
		"This philosopher is known for developing the theory of the categorical imperative.": "Immanuel Kant",
		"This philosophical concept refers to the belief in the separation of mind and body.": "Dualism",
		"This philosopher argued that humans are born with certain inalienable rights, including life, liberty, and property.": "John Locke",
		"This philosopher is associated with the concept of the ‘will to power.’": "Friedrich Nietzsche",
		"This term refers to the concept that everything in the universe is determined by prior causes.": "Determinism",
		"This philosopher developed the concept of the social contract and is known for writing The Leviathan.": "Thomas Hobbes",
		"This mountain is the highest peak in the world.": "Mount Everest",
		"This is the longest river in Africa.": "Nile River",
		"This is the largest desert in the world.": "Sahara Desert",
		"This country is known for the Great Barrier Reef.": "Australia",
		"This country has the most volcanoes.": "Indonesia",
		"This is the capital city of Canada.": "Ottawa",
		"This is the smallest country in the world.": "Vatican City",
		"This is the largest island in the world.": "Greenland",
		"This is the second largest country by land area.": "Canada",
		"This is the country known for the Eiffel Tower.": "France",
		"This is the largest ocean in the world.": "Pacific Ocean",
		"This is the longest mountain range in the world.": "Andes",
		"This river flows through the Grand Canyon.": "Colorado River",
		"This is the study of living organisms and their interactions with the environment.": "Ecology",
		"This term refers to the process by which plants convert sunlight into energy.": "Photosynthesis",
		"This part of the cell contains genetic material.": "Nucleus",
		"This type of organism can produce its own food using sunlight.": "Autotroph",
		"This is the chemical process in which cells break down glucose to produce energy.": "Cellular Respiration",
		"This system in humans is responsible for transporting oxygen and nutrients.": "Circulatory System",
		"This is the powerhouse of the cell.": "Mitochondria",
		"This type of bond involves the sharing of electrons between atoms.": "Covalent Bond",
		"This scientist is known for the laws of heredity and genetics.": "Gregor Mendel",
		"This type of reproduction involves two parent organisms.": "Sexual Reproduction",
		"This is the process by which a single parent organism produces offspring.": "Asexual Reproduction",
		"This is the branch of biology that studies heredity and the variation of organisms.": "Genetics",
		"This is the process in which plants and animals produce offspring.": "Reproduction",
		"This is the most famous mathematical constant, representing the ratio of a circle's circumference to its diameter.": "Pi",
		"This formula calculates the area of a rectangle.": "Length times Width",
		"This theorem in geometry states that in a right-angled triangle, the square of the hypotenuse is equal to the sum of the squares of the other two sides.": "Pythagorean Theorem",
		"This is the mathematical study of change, involving derivatives and integrals.": "Calculus",
		"This concept refers to the amount of space an object occupies.": "Volume",
		"This type of number is an integer that cannot be divided by any number except 1 and itself.": "Prime Number",
		"This is the set of all positive integers, including zero.": "Natural Numbers",
		"This equation is used to calculate the slope of a line in the coordinate plane.": "Slope Formula",
		"This is the result of dividing one number by another.": "Quotient",
		"This type of angle measures less than 90 degrees.": "Acute Angle",
		"This is a system of numbers that includes both positive and negative integers.": "Integers",
		"This is the distance around a circle.": "Circumference",
		"This type of graph is used to show how a value changes over time.": "Line Graph",
		"This programming language was developed by Guido van Rossum and emphasizes code readability.": "Python",
		"This term refers to a function that calls itself in programming.": "Recursion",
		"This type of programming language is designed to execute specific tasks, often related to system-level operations.": "Low level Language",
		"This is a key concept in object-oriented programming, where a class inherits properties from another class.": "Inheritance",
		"This structure in computer science is used to store and organize data.": "Data Structure",
		"This algorithm is used to sort an array or list by repeatedly finding the smallest or largest element.": "Selection Sort",
		"This data type in Python stores a sequence of characters.": "String",
		"This operation refers to combining two values to form a new value.": "Concatenation",
		"This concept refers to organizing data into layers, ensuring each layer performs a specific task.": "Abstraction",
		"This is the most common use of a hash table, which allows for fast data retrieval.": "Hashing",
		"This is a type of loop in programming that continues to run until a certain condition is met.": "While Loop",
		"This error occurs when a program tries to divide by zero.": "ZeroDivisionError",
		"This programming paradigm uses the concept of classes and objects.": "Object Oriented Programming",
		"This particle's discovery was crucial in the development of quantum mechanics and it has a mass much smaller than that of an electron.": "neutrino",
		"This equation describes the behavior of matter at extremely small scales and led to the field of quantum mechanics.": "Schrodingers Equation",
		"This scientist developed the uncertainty principle, which states that certain pairs of physical properties cannot be precisely measured simultaneously.": "Werner Heisenberg",
		"This famous theory explains the relationship between mass and energy, and is represented by the equation E=mc^2.": "Theory of Relativity",
		"This concept in physics describes the theory of everything that unifies the four fundamental forces of nature.": "Grand Unified Theory",
		"This branch of physics deals with the study of systems that are in equilibrium.": "Thermodynamics",
		"This law of physics states that energy cannot be created or destroyed, only transformed from one form to another.": "First Law of Thermodynamics",
		"This type of energy is stored within the bonds of chemical compounds and is released during a chemical reaction.": "Chemical Energy",
		"This principle states that the entropy of an isolated system always increases over time.": "Second Law of Thermodynamics",
		"This type of energy is associated with the motion of objects.": "Kinetic Energy",
		"This principle in physics suggests that no information can travel faster than the speed of light.": "Theory of Relativity",
		"This famous equation in physics describes the relationship between energy, mass, and the speed of light.": "E=mc^2",
		"This constant is used to describe the force of gravity between two objects.": "Gravitational Constant",
		"This branch of physics studies subatomic particles and their interactions.": "Quantum Physics",
		"This phenomenon occurs when a light wave passes through a narrow slit and spreads out.": "Diffraction",
		"This type of radiation has the longest wavelength and is the least energetic.": "Radio Waves",
		"This is the process by which heat is transferred through a fluid (liquid or gas).": "Convection",
		"This principle states that an object's velocity is inversely proportional to the force it exerts on the object.": "Newton's Second Law",
		"This concept in quantum mechanics states that particles can exist in multiple states simultaneously until measured.": "Superposition",
		"This concept in quantum mechanics refers to the phenomenon of particles being entangled and instantly affecting each other, regardless of distance.": "Quantum Entanglement",
		"This principle states that particles can behave as both waves and particles.": "Wave-Particle Duality",
		"This scientist proposed the heliocentric model of the solar system, where the Earth orbits the Sun.": "Nicolaus Copernicus"
	}
}