{
  "This principle states that the total energy in a closed system remains constant.": "Conservation of Energy",
  "This law of motion explains how an object moves when no forces act on it.": "Newtons First Law",
  "This phenomenon describes how light bends when it passes through different media.": "Refraction",
  "This fundamental force is responsible for holding the nucleus of an atom together.": "Strong Nuclear Force",
  "This type of wave does not require a medium to travel through.": "Electromagnetic Wave",
  "This famous scientist developed the theory of relativity.": "Albert Einstein",
  "This particle has a negative charge and orbits the nucleus of an atom.": "Electron",
  "This is the unit of electric current.": "Ampere",
  "This device is used to measure the electric potential difference between two points.": "Voltmeter",
  "This force is responsible for the motion of the planets around the Sun.": "Gravitational Force",
  "This theory explains the behavior of gases in terms of particles in motion.": "Kinetic Molecular Theory",
  "This type of radiation has the highest energy and can ionize atoms.": "Gamma Rays",
  "This law relates the pressure and volume of a gas at constant temperature.": "Boyles Law",
  
  "This philosopher is famous for his work Meditations.": "Marcus Aurelius",
  "This theory suggests that actions should aim for the greatest happiness for the greatest number.": "Utilitarianism",
  "This philosopher wrote The Republic and proposed the theory of Forms.": "Plato",
  "This philosopher is known for the Socratic method and his contributions to ethics.": "Socrates",
  "This concept refers to the fundamental nature of reality and existence.": "Metaphysics",
  "This philosopher wrote the book On Liberty and is known for his contributions to political philosophy.": "John Stuart Mill",
  "This philosophical branch studies the nature of knowledge.": "Epistemology",
  "This philosopher is known for developing the theory of the categorical imperative.": "Immanuel Kant",
  "This philosophical concept refers to the belief in the separation of mind and body.": "Dualism",
  "This philosopher argued that humans are born with certain inalienable rights, including life, liberty, and property.": "John Locke",
  "This philosopher is associated with the concept of the ‘will to power.’": "Friedrich Nietzsche",
  "This term refers to the concept that everything in the universe is determined by prior causes.": "Determinism",
  "This philosopher developed the concept of the social contract and is known for writing The Leviathan.": "Thomas Hobbes",
  "This mountain is the highest peak in the world.": "Mount Everest",
  "This is the longest river in Africa.": "Nile River",
  "This is the largest desert in the world.": "Sahara Desert",
  "This country is known for the Great Barrier Reef.": "Australia",
  "This country has the most volcanoes.": "Indonesia",
  "This is the capital city of Canada.": "Ottawa",
  "This is the smallest country in the world.": "Vatican City",
  "This is the largest island in the world.": "Greenland",
  "This is the second largest country by land area.": "Canada",
  "This is the country known for the Eiffel Tower.": "France",
  "This is the largest ocean in the world.": "Pacific Ocean",
  "This is the longest mountain range in the world.": "Andes",
  "This river flows through the Grand Canyon.": "Colorado River",
  "This is the study of living organisms and their interactions with the environment.": "Ecology",
  "This term refers to the process by which plants convert sunlight into energy.": "Photosynthesis",
  "This part of the cell contains genetic material.": "Nucleus",
  "This type of organism can produce its own food using sunlight.": "Autotroph",
  "This is the chemical process in which cells break down glucose to produce energy.": "Cellular Respiration",
  "This system in humans is responsible for transporting oxygen and nutrients.": "Circulatory System",
  "This is the powerhouse of the cell.": "Mitochondria",
  "This type of bond involves the sharing of electrons between atoms.": "Covalent Bond",
  "This scientist is known for the laws of heredity and genetics.": "Gregor Mendel",
  "This type of reproduction involves two parent organisms.": "Sexual Reproduction",
  "This is the process by which a single parent organism produces offspring.": "Asexual Reproduction",
  "This is the branch of biology that studies heredity and the variation of organisms.": "Genetics",
  "This is the process in which plants and animals produce offspring.": "Reproduction",
  "This is the most famous mathematical constant, representing the ratio of a circle's circumference to its diameter.": "Pi",
  "This formula calculates the area of a rectangle.": "Length times Width",
  "This theorem in geometry states that in a right-angled triangle, the square of the hypotenuse is equal to the sum of the squares of the other two sides.": "Pythagorean Theorem",
  "This is the mathematical study of change, involving derivatives and integrals.": "Calculus",
  "This concept refers to the amount of space an object occupies.": "Volume",
  "This type of number is an integer that cannot be divided by any number except 1 and itself.": "Prime Number",
  "This is the set of all positive integers, including zero.": "Natural Numbers",
  "This equation is used to calculate the slope of a line in the coordinate plane.": "Slope Formula",
  "This is the result of dividing one number by another.": "Quotient",
  "This type of angle measures less than 90 degrees.": "Acute Angle",
  "This is a system of numbers that includes both positive and negative integers.": "Integers",
  "This is the distance around a circle.": "Circumference",
  "This type of graph is used to show how a value changes over time.": "Line Graph",
  "This programming language was developed by Guido van Rossum and emphasizes code readability.": "Python",
  "This term refers to a function that calls itself in programming.": "Recursion",
  "This type of programming language is designed to execute specific tasks, often related to system-level operations.": "Low level Language",
  "This is a key concept in object-oriented programming, where a class inherits properties from another class.": "Inheritance",
  "This structure in computer science is used to store and organize data.": "Data Structure",
  "This algorithm is used to sort an array or list by repeatedly finding the smallest or largest element.": "Selection Sort",
  "This data type in Python stores a sequence of characters.": "String",
  "This operation refers to combining two values to form a new value.": "Concatenation",
  "This concept refers to organizing data into layers, ensuring each layer performs a specific task.": "Abstraction",
  "This is the most common use of a hash table, which allows for fast data retrieval.": "Hashing",
  "This is a type of loop in programming that continues to run until a certain condition is met.": "While Loop",
  "This error occurs when a program tries to divide by zero.": "ZeroDivisionError",
  "This programming paradigm uses the concept of classes and objects.": "Object Oriented Programming",
  "This particle's discovery was crucial in the development of quantum mechanics and it has a mass much smaller than that of an electron.": "Neutrino",
  "This equation describes the behavior of matter at extremely small scales and led to the field of quantum mechanics.": "Schrodingers Equation",
  "This scientist developed the uncertainty principle, which states that certain pairs of physical properties cannot be precisely measured simultaneously.": "Werner Heisenberg",
  "This famous theory explains the relationship between mass and energy, and is represented by the equation E=mc^2.": "Theory of Relativity",
  "This concept in physics describes the theory of everything that unifies the four fundamental forces of nature.": "Grand Unified Theory",
  "This branch of physics deals with the study of systems that are in equilibrium.": "Thermodynamics",
  "This law of physics states that energy cannot be created or destroyed, only transformed from one form to another.": "First Law of Thermodynamics",
  "This type of energy is stored within the bonds of chemical compounds and is released during a chemical reaction.": "Chemical Energy",
  "This principle states that the entropy of an isolated system always increases over time.": "Second Law of Thermodynamics",
  "This theory suggests that the universe began as a singularity and expanded over time.": "Big Bang Theory",
  
  "This term refers to the theory that time and space are interconnected and form a four-dimensional continuum.": "Space-Time",
  "This method in calculus is used to find the tangent to a curve at any given point.": "Differentiation",
  "This type of matrix is used to represent transformations in three-dimensional space.": "Transformation Matrix",
  "This mathematical conjecture, still unproven, states that every even integer greater than 2 can be expressed as the sum of two primes.": "Goldbach's Conjecture",
  "This mathematician is famous for developing the theory of number fields, including the notion of a 'finite field.'": "Emmy Noether",
  "This type of number is the solution to a polynomial equation with rational coefficients but not a rational number.": "Algebraic Number",
  "This famous theorem in number theory proves that no three positive integers a, b, and c can satisfy the equation a^n + b^n = c^n for any integer value of n greater than 2.": "Fermat's Last Theorem",
  "This series is defined as the sum of the reciprocals of the powers of two and converges to a constant.": "Zeta Function",
  "This type of logic involves reasoning that allows for making conclusions based on premises and leads to mathematical proofs.": "Formal Logic",
  "This concept is used in probability theory to measure the uncertainty of an event occurring.": "Entropy",
  "This technique in geometry allows the division of space into smaller, more manageable shapes.": "Tessellation",
  "This is the most famous example of a curve in algebraic geometry, and its equation is y^2 = x^3 + ax + b.": "Elliptic Curve",
  
  "This term in computer science refers to a programming method where the function calls itself repeatedly.": "Recursion",
  "This type of data structure organizes data into a tree-like structure, with nodes having one parent but potentially many children.": "Tree",
  "This is the term for a system that uses a series of if-else statements to simulate human-like reasoning.": "Expert System",
  "This type of programming language is used to write instructions that the machine can execute directly, such as assembly language.": "Low-Level Programming",
  "This process refers to an algorithm that repeatedly improves the solution to a problem by applying small changes.": "Gradient Descent",
  "This type of analysis is used to evaluate and optimize algorithms by analyzing their performance as input size grows.": "Big O Notation",
  "This type of programming involves describing how data flows and is transformed without specifying control flow.": "Functional Programming",
  "This is the method used to locate the fastest path between nodes in a graph, commonly used in routing algorithms.": "Dijkstra's Algorithm",
  "This type of machine learning involves a model that predicts continuous output, such as regression.": "Supervised Learning",
  "This programming language was designed to be simple and is widely used for automating system-level tasks.": "Bash",
  "This type of memory in a computer is used to store frequently accessed data for quick retrieval.": "Cache Memory",
  "This concept refers to the practice of using parallel computing to speed up complex calculations.": "Parallelism",
  "This system of algorithms enables computers to recognize spoken words by processing audio input.": "Speech Recognition",
  
  "This is the philosopher who said 'Cogito, ergo sum' or 'I think, therefore I am.'": "René Descartes",
  "This philosopher is known for his work on political theory and the concept of the 'veil of ignorance.'": "John Rawls",
  "This philosopher developed the idea of 'phenomenology,' the study of structures of consciousness.": "Edmund Husserl",
  "This theory suggests that the nature of reality is ultimately reducible to mental phenomena.": "Idealism",
  "This philosopher argued that the pursuit of happiness was the ultimate goal of human life.": "Aristotle",
  "This philosopher's works inspired existentialism, especially the concept of 'bad faith.'": "Jean-Paul Sartre",
  "This philosopher developed the concept of the 'unconscious mind' and psychoanalysis.": "Sigmund Freud",
  "This school of thought posits that only physical things exist, and everything else, including the mind, is a result of material processes.": "Physicalism",
  "This famous concept in ethics, proposed by Aristotle, involves the pursuit of virtuous behavior as a means to achieve happiness.": "Eudaimonia",
  "This philosopher is known for his critique of capitalist society and the development of historical materialism.": "Karl Marx",
  "This philosopher is known for his concept of 'the will to power' and the idea of 'eternal recurrence.'": "Friedrich Nietzsche",
  "This is the concept in epistemology that suggests that knowledge comes from sensory experience.": "Empiricism",
  "This philosopher's work centered on the idea of skepticism and the notion that knowledge is limited.": "Pyrrho of Elis",
  
  "This historical event marked the beginning of World War I, following the assassination of Archduke Franz Ferdinand.": "Assassination of Archduke Ferdinand",
  "This war, fought between the United States and the Confederacy, was primarily about the abolition of slavery.": "American Civil War",
  "This empire controlled much of Eastern Europe and the Middle East before its fall at the end of World War I.": "Ottoman Empire",
  "This famous revolution led to the establishment of the Soviet Union in 1917.": "Russian Revolution",
  "This treaty officially ended World War I and imposed heavy reparations on Germany.": "Treaty of Versailles",
  "This battle was a turning point in the American Revolution and marked the beginning of the end for British forces in America.": "Battle of Saratoga",
  "This event in 1789 marked the start of the French Revolution, a key moment in world history.": "Storming of the Bastille",
  "This historical period, lasting from the 14th to the 17th century, saw a renewed interest in art, science, and exploration.": "Renaissance",
  "This event was the formal division of the Christian Church into Catholicism and Eastern Orthodoxy.": "Great Schism",
  "This empire was known for its advanced culture, art, and technology, as well as its brutal conquests.": "Aztec Empire",
  "This historical figure is known for his assassination of Julius Caesar.": "Brutus",
  "This war, lasting from 1950 to 1953, was a conflict between North Korea and South Korea, with the United States and China involved.": "Korean War",
  "This empire was at the height of its power in the 6th century under the reign of Justinian I.": "Byzantine Empire"
}
